75道选择题+5道简答题
1. 5G网络技术具有（ 高带宽，低时延）的特点。
5G技术——第五代移动通信技术，是具有高速率（高带宽）、低时延和大连接特点的新一代移动通信技术，是实现人机物互联的网络基础。
2. 在程序执行过程中，高速缓存(Cache) 与主存间的地址映射由（ 硬件自动完成）
Cache与主存的地址映像需要专门的硬件自动完成，使用硬件来处理具有更高的转换速率
3. 计算机中提供指令地址的程序计数器(PC) 在（ 控制器）中
CPU主要由运算器、控制器、寄存器组和内部总线等部件组成
运算器由算术逻辑单元、累加寄存器、数据缓冲寄存器和条件状态寄存器组成，是数据加工处理部件，用于完成计算机的各种算术和逻辑运算
控制器用于控制整个CPU的工作，决定了计算机运行过程的自动化，不仅能保证程序的正确执行，而且还能处理异常事件，控制器一般包括指令控制逻辑（包括：指令寄存器、程序计数器、地址寄存器、指令译码器）、时序控制逻辑、总线控制逻辑和中断控制逻辑等几个部分

错题知识点
指令系统
1、寻址方式
立即寻址：直接将操作数指出
直接寻址：将操作数的地址指出
寄存器寻址：将操作数放在CPU中的通用寄存器中
寄存器间接寻址：将操作数的地址放在CPU中的通用寄存器中

2、寄存器
通用寄存器：传送和暂存数据，参与算术逻辑运算，并保存运算结果
程序计数器pc：存放  下一条指令  所在单元的地址的地方
指令寄存器：存放 当前从主存储器读出的 正在执行的 一条指令
地址寄存器：保存 当前CPU 所访问的 内存单元的地址

存储系统
1、虚拟存储=主存+辅存

刷真题
复合条件要拆分为单个条件    与，两个都为真才能真     或  一个为真就为真
[图片]

V（G）圈复杂度=子条件节点的个数+1=封闭区域数+1
线性无关路径条数=V(G)
