1、白盒测试
问题一：根据C程序将判断逻辑写出来，真假都写，例如：x>10,x<=10。
可以参考分值，6分，指的是有6个逻辑条件，你得写出真假，那就是需要写12条
注意逻辑用语的书写规范，或、且符号
[图片]
[图片]
问题二：画控制流图，根据标号定节点，计算V(G)，边长-节点+2  或者直接看判断子节点数  区域数+1
V(g)就是最少执行用例数
问题三 ：线性无关路径
路径没有重复的路径，也是根据分值填写

2、黑盒测试   简答题
根据材料对表格进行填充，
问题一：补充有效等价类和无效等价类
问题二：补充测试用例
问题三：描述测试方法的不足

3、材料题
问题一：考子特性和
问题二：考测试矩阵，根据题目条件列表格
[图片]
问题三：考Apdex（分层架构
[图片]
Apdex=（满意的样本数+容忍的样本数/2）/总样本数
=（7150+450/2）/（7150+450+400）≈0.9219
因为0.9219大于期望值0.9，所以是达到要求


4、面向对象
继承关系：空心三角箭
关联关系：双向：两边都有箭头或者两边都没有箭头   单向就是实线普通箭头
组合：菱形箭头实线
依赖：虚线箭头

5、分布式架构
问题一：分布式架构部署的优点
问题二：

6、分层架构

子特性考点
子特性：xxx的依从性，每个子特性都有
功能性：功能完备性、功能正确性、功能适合性、功能性的依从性
性能效率：时间特性、资源利用性、容量、性能效率的依从性
兼容性：共存性、互操作性、兼容性的依从性
易用性：可辨识性、易学性、易操作性、易访问性、用户查错防御性、用户界面舒适性、易用性的依从性
可靠性：成熟性、可用性、容错性、易恢复性、可靠性的依从性
信息安全性：保密性、完整性、真实性、可核查性、抗抵赖性、信息安全性的依从性
维护性：易分析、易修改、易测试性、模块性、可重用性、维护性的依从性
可移植性：适应性、易安装性、易替换性、可移植性的依从性
